app/helpers/articles_helper.rb

  def get_articles_by_year(year)
    Article.all.filter {|a| a.created_at.year == year}
---
SELECT "articles".* FROM "articles"

  def get_articles_by_month(articles=Article.all, month)
---
SELECT "articles".* FROM "articles"