app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "genji.png"], ["image_updated_at", "2019-05-20 15:53:47.391972"], ["updated_at", "2019-05-20 15:53:47.637710"], ["id", 3]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)