app/controllers/authors_controller.rb

UPDATE "authors" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["salt", "PnMjF4VuWQXMSbswqrCr"], ["crypted_password", "$2a$10$jYbfeUmXBqBPGmS7SNJb1eyha/nKhE7vXs/Kk2/Na0TEsUVIOSIE6"], ["updated_at", "2019-05-21 00:41:34.667558"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)